PlayXboxtion963/STM32_EnvironmentMonitor/User/LCD1602.h
#include "stm32f10x_rcc.h"
#include "system.h"
#include "stm32f10x_gpio.h"
#include "SysTick.h"
/***********************************引脚定义********************************************/
#define BUSY 0x80		//忙标志
#define RS GPIO_Pin_5	//设置PB5为RS
#define RW GPIO_Pin_6	//PB6为RW
#define EN GPIO_Pin_7	//PB7为EN使能
void ReadBusy(void);
void LCD_WRITE_CMD( unsigned char CMD );
void LCD_WRITE_StrDATA( unsigned char *StrData, unsigned char row, unsigned char col );
void LCD_WRITE_ByteDATA( unsigned char ByteData );
void LCD_INIT(void);
void GPIO_INIT(void);
void WUserImg(unsigned char pos,unsigned char *ImgInfo);

void GPIO_INIT(void){		//GPIO初始化
	GPIO_InitTypeDef PB;
	GPIO_InitTypeDef PF;
	
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);	//禁用jtag，不然写入程序和程序执行都会受影响
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOF, ENABLE );
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOB, ENABLE );		//打开GPIOF~B
	//RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOC, ENABLE );
	
	PB.GPIO_Pin = EN|RW|RS;
	PB.GPIO_Mode = GPIO_Mode_Out_PP;
	PB.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &PB);
	
	PF.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|
				  GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|
				  GPIO_Pin_6|GPIO_Pin_7;
	PF.GPIO_Mode = GPIO_Mode_Out_PP;
	PF.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOF, &PF);
	
}
void LCD_INIT(void){	//初始化
	GPIO_INIT();	//GPIO的初始化，在LCD_INIT被调用时自动调用
	
	GPIO_Write( GPIOF, 0x0000 );		//初始化GPIOF和GOIOB的值为0x0000，可以不用，个人习惯
	GPIO_Write( GPIOB, 0x0000 );
	
	delay_us(500);
	
	LCD_WRITE_CMD( 0x38 );
	LCD_WRITE_CMD( 0x0c );	//开启光标和闪烁
	LCD_WRITE_CMD( 0x06 );
	LCD_WRITE_CMD( 0x01 );
}
/***********************************LCD初始化********************************************/

/***********************************写入命令函数********************************************/
void LCD_WRITE_CMD( unsigned char CMD ){		//写入命令函数
	ReadBusy();
	GPIO_ResetBits( GPIOB, RS );
	GPIO_ResetBits( GPIOB, RW );
	GPIO_ResetBits( GPIOB, EN );
	GPIO_Write( GPIOF, CMD );		//
	GPIO_SetBits( GPIOB, EN );
	GPIO_ResetBits( GPIOB, EN );
}
/***********************************写入命令函数********************************************/

/***********************************写入单个Byte函数********************************************/
void LCD_WRITE_ByteDATA( unsigned char ByteData ){	//写入单个Byte函数
	ReadBusy();
	GPIO_SetBits( GPIOB, RS );
	GPIO_ResetBits( GPIOB, RW );
	GPIO_ResetBits( GPIOB, EN );
	GPIO_Write( GPIOF, ByteData );
	GPIO_SetBits( GPIOB, EN );
	GPIO_ResetBits( GPIOB, EN );
}

/***********************************写入单个Byte函数********************************************/

/***********************************写入字符串函数********************************************/

void LCD_WRITE_StrDATA( unsigned char *StrData, unsigned char row, unsigned char col ){//写入字符串
	unsigned char baseAddr = 0x00;			//定义8位地址
	if ( row ){
		baseAddr = 0xc0;
	}else{
		baseAddr = 0x80;																				   
	} 	//row为1用户选择第二行
		//row为0用户选择第一行
	baseAddr += col;

	while ( *StrData != '\0' ){

		LCD_WRITE_CMD( baseAddr );
		LCD_WRITE_ByteDATA( *StrData );
	
		baseAddr++;			   //每次循环地址加一，数据指针加一
		StrData++;
	}
}
/***********************************写入字符串函数********************************************/

/***********************************读忙函数********************************************/
void ReadBusy(void){		//读忙函数，读忙之前记得更改引脚的工作方式！！！因为STM32的IO不是准双向IO
	GPIO_InitTypeDef p;
	GPIO_Write( GPIOF, 0x00ff );	
	
	
	p.GPIO_Pin = GPIO_Pin_7;		//选定GPIOF的第七Pin
	p.GPIO_Mode = GPIO_Mode_IN_FLOATING;	//第七Pin的工作方式为浮空输入模式，用于检测LCD1602的忙状态
	p.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init( GPIOF, &p );
	
	GPIO_ResetBits( GPIOB, RS );//RS拉低
	GPIO_SetBits( GPIOB, RW );//RW拉高
	
	GPIO_SetBits( GPIOB, EN );	//使能开
	while( GPIO_ReadInputDataBit( GPIOF, GPIO_Pin_7 ) );	//读第七Pin状态，如果一直为1则循环等待
	GPIO_ResetBits( GPIOB, EN );//使能关
		
	p.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|
				  GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|
				  GPIO_Pin_6|GPIO_Pin_7;		//使GPIOF的状态还原成推挽模式
	p.GPIO_Mode = GPIO_Mode_Out_PP;
	p.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init( GPIOF, &p  );
}
/***********************************读忙函数********************************************/

/***********************************写入用户自定义图像********************************************/
void WUserImg(unsigned char pos,unsigned char *ImgInfo){ //写入用户自定义图像
	unsigned char cgramAddr;			//CGRAM的用户自定义字符位
	
	if( pos <= 1 ) cgramAddr = 0x40;		// 
	if( pos > 1 && pos <= 3 ) cgramAddr = 0x50;
	if( pos > 3 && pos <= 5 ) cgramAddr = 0x60;
	if( pos > 5 && pos <= 7 ) cgramAddr = 0x70;

	LCD_WRITE_CMD( (cgramAddr + (pos%2) * 8) );	//指定字模写入的地址，一般从0x40开始，0x78结束
	
	while( *ImgInfo != '\0' ){		//循环写入tem数据,即用户取模的数据
		LCD_WRITE_ByteDATA( *ImgInfo );
		ImgInfo++;
	}
}
